Config/InformationRegisters/СрокиИсполненияИСуммыОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СрокиИсполненияИСуммыОбязательств</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвансПроцентом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсРасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьРасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоЗайму</Name>
					<Comment>Установленный договором займа процент за пользьвание займом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КазначейскоеСопровождение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОплатаВИностраннойВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаВРублях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОбязательства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПринятыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОбязательствИСведенийПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обязательство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ПараметрыСписанияДоходовБудущихПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыСписанияДоходовБудущихПериодов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачисленияДБП</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПринятияКУчетуПравПользованияОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПризнанияДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПризнанияРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходов1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходов2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходов3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиНУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиДляНалоговогоУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходовНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяПрочихДоходовНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ЗначенияДополнительныхРеквизитовОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхРеквизитовОтчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаписьАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизитОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭкземплярОтчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАналитики</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикаОтчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ПланФинансированияОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПланФинансированияОбязательств</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеБезусловная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИсполнено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИсполненоБезусловно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обязательство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючАналитикиПФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОКП</Name>
					<Comment>Код по общероссийскому классификатору продукции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыОперацийНачисленияДБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНачисленияДБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАрендуНаЛьготныхУсловиях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочныйДоговорОбразование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходыБудущихПериодов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/CommonModules/ЗаполнениеОтчетностиПовтИсп/Ext/Module.bsl
Функция ПолучитьРеквизитДоговора(Знач ДоговорСсылка, Знач РеквизитДоговора, Знач ЗначениеНеопределено = Неопределено, Период = Неопределено) Экспорт
	
    РеквизитДоговораПоиск = Неопределено;
		
	Если ТипЗнч(ДоговорСсылка) <> Тип("СправочникСсылка.Договоры") ИЛИ НЕ ЗначениеЗаполнено(РеквизитДоговора) ИЛИ НЕ ЗначениеЗаполнено(ДоговорСсылка) Тогда
		Возврат ЗначениеНеопределено;
	ИначеЕсли ТипЗнч(РеквизитДоговора) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		РеквизитДоговораПоиск = РеквизитДоговора;
	ИначеЕсли ТипЗнч(РеквизитДоговора) = Тип("Строка") Тогда
		ИмяРеквизита = НРег(СокрЛП(РеквизитДоговора));
		Если ИмяРеквизита = "окончание" Тогда
			РеквизитДоговораПоиск = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ОкончаниеДоговора;
			Если ПолучитьФункциональнуюОпцию("СрокИсполненияВРегистреСрокиИсполненияИСуммыОбязательств") Тогда
				СрокиПоДоговорам = УчетРасчетов.СрокиИсполненияИСуммыОбязательствПоДоговорам(ДоговорСсылка, Период);
				СрокиПоДоговору = СрокиПоДоговорам.Найти(ДоговорСсылка, "Договор");
				Возврат ?(СрокиПоДоговору = Неопределено, ЗначениеНеопределено, СрокиПоДоговору.ОкончаниеДоговора);
			КонецЕсли;
		ИначеЕсли ИмяРеквизита = "возникновение" Тогда
			ДатаВозникновенияЗадолженности = УчетРасчетов.ДатаВозникновенияЗадолженности(ДоговорСсылка);
			Возврат ?(ЗначениеЗаполнено(ДатаВозникновенияЗадолженности), ДатаВозникновенияЗадолженности, ЗначениеНеопределено);
		ИначеЕсли ИмяРеквизита = "просрочен" Тогда
			РеквизитДоговораПоиск = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДоговорПросрочен;
			Если ПолучитьФункциональнуюОпцию("СрокИсполненияВРегистреСрокиИсполненияИСуммыОбязательств") Тогда
				СрокиПоДоговорам = УчетРасчетов.СрокиИсполненияИСуммыОбязательствПоДоговорам(ДоговорСсылка, Период);
				СрокиПоДоговору = СрокиПоДоговорам.Найти(ДоговорСсылка, "Договор");
				Возврат ?(СрокиПоДоговору = Неопределено, ЗначениеНеопределено, СрокиПоДоговору.ДоговорПросрочен);
			КонецЕсли;
		ИначеЕсли ИмяРеквизита = "крупнаясделка" Тогда
			РеквизитДоговораПоиск = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.КрупнаяСделка;
		ИначеЕсли ИмяРеквизита = "сделкасзаинт" Тогда
			Возврат ЗаполнениеОтчетности.ПолучитьХарактеристикуДоговора(ДоговорСсылка, "СделкаСЗаинт", Период, ЗначениеНеопределено);
		ИначеЕсли ИмяРеквизита = "учетныйномеробязательства" Тогда
			Возврат РаботаСОбязательствами.ПолучитьУчетныйНомерОбязательства(ДоговорСсылка);
		ИначеЕсли ИмяРеквизита = "кофк" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Договоры.Ссылка КАК Договор,
				|	ЕстьNULL(СрокиИсполненияИСуммыОбязательствСрезПоследних.ОрганКазначейства.Код,&ПустаяСтрока) КАК КОФК
				|ИЗ
				|	РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(&Период, ) КАК СрокиИсполненияИСуммыОбязательствСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
				|		ПО СрокиИсполненияИСуммыОбязательствСрезПоследних.Обязательство = Договоры.Ссылка
				|ГДЕ
				|	Договоры.Ссылка = &ДоговорСсылка";
			Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
			Запрос.УстановитьПараметр("Период", Период);
			Запрос.УстановитьПараметр("ПустаяСтрока", "");			
				
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Возврат ВыборкаДетальныеЗаписи.КОФК;
			КонецЕсли;
			
			Возврат ЗначениеНеопределено;
			
		ИначеЕсли ИмяРеквизита = "суммаподоговору" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Договоры.Ссылка КАК Договор,
				|	ЕстьNULL(СрокиИсполненияИСуммыОбязательствСрезПоследних.Сумма,0) КАК СуммаПоДоговору
				|ИЗ
				|	РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(&Период, ) КАК СрокиИсполненияИСуммыОбязательствСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
				|		ПО СрокиИсполненияИСуммыОбязательствСрезПоследних.Обязательство = Договоры.Ссылка
				|ГДЕ
				|	Договоры.Ссылка = &ДоговорСсылка";
			Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
			Запрос.УстановитьПараметр("Период", Период);
				
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Возврат ВыборкаДетальныеЗаписи.СуммаПоДоговору;
			КонецЕсли;
			
			Возврат ЗначениеНеопределено;
			
		ИначеЕсли ИмяРеквизита = "льготнаяаренда" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Договоры.Ссылка КАК Договор,
				|	ЕСТЬNULL(ПараметрыСписанияДоходовБудущихПериодовСрезПоследних.ВидОперации, НЕОПРЕДЕЛЕНО) КАК ВидОперации
				|ИЗ
				|	РегистрСведений.ПараметрыСписанияДоходовБудущихПериодов.СрезПоследних(&Период, ) КАК ПараметрыСписанияДоходовБудущихПериодовСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
				|		ПО ПараметрыСписанияДоходовБудущихПериодовСрезПоследних.Договор = Договоры.Ссылка
				|ГДЕ
				|	Договоры.Ссылка = &ДоговорСсылка";
			Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
			Запрос.УстановитьПараметр("Период", Период);
				
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Возврат ВыборкаДетальныеЗаписи.ВидОперации = ПредопределенноеЗначение(Перечисления.ВидыОперацийНачисленияДБП.ПередачаВАрендуНаЛьготныхУсловиях);
			КонецЕсли;
			
			Возврат ЗначениеНеопределено	
			
		ИначеЕсли ИмяРеквизита = "срокисполнения" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Договоры.Ссылка КАК Договор,
				|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательствСрезПоследних.СрокИсполнения, НЕОПРЕДЕЛЕНО) КАК СрокИсполнения
				|ИЗ
				|	РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(&Период, ) КАК СрокиИсполненияИСуммыОбязательствСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
				|		ПО СрокиИсполненияИСуммыОбязательствСрезПоследних.Обязательство = Договоры.Ссылка
				|ГДЕ
				|	Договоры.Ссылка = &ДоговорСсылка";
			Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
			Запрос.УстановитьПараметр("Период", Период);
				
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Возврат ВыборкаДетальныеЗаписи.СрокИсполнения;
			КонецЕсли;
			
			Возврат ЗначениеНеопределено;
			
		Иначе
			Возврат ЗначениеНеопределено;
		КонецЕсли;
	Иначе
		Возврат ЗначениеНеопределено;
	КонецЕсли;
	
	Если РеквизитДоговораПоиск = Неопределено Тогда
		Возврат ЗначениеНеопределено;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ДоговорыДополнительныеРеквизиты.Значение
		|ИЗ
		|	Справочник.Договоры.ДополнительныеРеквизиты КАК ДоговорыДополнительныеРеквизиты
		|ГДЕ
		|	ДоговорыДополнительныеРеквизиты.Свойство = &Свойство
		|	И ДоговорыДополнительныеРеквизиты.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Свойство", РеквизитДоговораПоиск);
	Запрос.УстановитьПараметр("Ссылка", ДоговорСсылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат ЗначениеНеопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Значение;
		
	КонецЕсли;	
	
КонецФункции


Функция ЗначениеДопРеквизитаОтчета(ДокументСсылка,ИмяРеквизита) Экспорт
	
	ПустоеЗначени = "Значение_Не_Заполнено";
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) 
		ИЛИ НЕ ЗначениеЗаполнено(ИмяРеквизита) Тогда
		Возврат ПустоеЗначени;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияДополнительныхРеквизитовОтчета.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхРеквизитовОтчета КАК ЗначенияДополнительныхРеквизитовОтчета
		|ГДЕ
		|	ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета = &ЭкземплярОтчета
		|	И ЗначенияДополнительныхРеквизитовОтчета.ДополнительныйРеквизитОтчета.Наименование = &ИмяРеквизита";
	
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	Запрос.УстановитьПараметр("ЭкземплярОтчета", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	Возврат ПустоеЗначени;
	
КонецФункции


Функция ВернутьКонтрагентаПоОрганизации(Знач Организация,Знач СоздаватьКонтрагента = Ложь, РезультатСтруктурой = Истина) Экспорт
	
	ИскомыйКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		
	Если СоздаватьКонтрагента = Ложь ИЛИ РезультатСтруктурой = Ложь Тогда
		
		ИскомыйКонтрагент = ЗаполнениеОтчетностиСервер.ПолучитьКонтрагентаПоОрганизации(Организация, СоздаватьКонтрагента);
		
	ИначеЕсли РезультатСтруктурой = Истина Тогда
		
		ИскомыйКонтрагент = ЗаполнениеОтчетностиСервер.ПолучитьКонтрагентаПоОрганизации(Организация, Ложь);
		
	КонецЕсли;
	
	Если РезультатСтруктурой = Истина Тогда
		//Если результат вернем структурой, заполним ее настройки
		Если ЗначениеЗаполнено(ИскомыйКонтрагент) ИЛИ СоздаватьКонтрагента = Ложь Тогда
			//Если контрагент уже есть или не нужно создавать контрагента, вернем что есть
			ВернутьПоУмолчанию = Новый Структура("Действие,Значение","ПрименитьЗначение", ИскомыйКонтрагент);
		Иначе
			//Если же контрагент нужен, но его есть, сохраним параметры создания контрагента для последующего создания
			ВернутьПоУмолчанию = Новый Структура("Действие,Организация","ПолучитьКонтрагентаПоОрганизации", Организация);
		КонецЕсли;
	Иначе
		//Если результат не структурой, вернем найденного контрагента
		ВернутьПоУмолчанию = ИскомыйКонтрагент;
	КонецЕсли;
		
	Возврат ВернутьПоУмолчанию;
	
КонецФункции

Функция ВернутьКлассификаторПоКлючу(Знач КодКлассификатора, Знач КодАналитикиОтчетов, Знач НаименованиеКлассификатора = "", Знач ЗначениеПоУмолчанию = Неопределено, РезультатСтруктурой = Истина, АктуализироватьНаименование = Ложь) Экспорт
	
	Если РезультатСтруктурой = Истина Тогда
		ВернутьПоУмолчанию = Новый Структура("Действие,Значение","ПрименитьЗначение",ЗначениеПоУмолчанию);
	Иначе
		ВернутьПоУмолчанию = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ВидАналитики = ПланыВидовХарактеристик.АналитикаОтчетов.НайтиПоКоду(КодАналитикиОтчетов);
	Если ВидАналитики.Пустая() Тогда
		Возврат ВернутьПоУмолчанию;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КодКлассификатора) Тогда
		Возврат ВернутьПоУмолчанию;
	КонецЕсли;
	
	ВладелецСубконото  = БюджетнаяОтчетностьСервер.ПолучитьВладельцаСубконтоДляАналитики(ВидАналитики); 
	
	КодКлассификатора = СокрЛП(КодКлассификатора);
		
	Ссылка = Справочники.Субконто.НайтиПоКоду(КодКлассификатора, , , ВладелецСубконото);
	
	Если РезультатСтруктурой Тогда
		
		Если Ссылка.Пустая() Тогда	
			Возврат Новый Структура("Действие,КодАналитики,КодКлассификатора,НаименованиеКлассификатора,ЗначениеПоУмолчанию,АктуализироватьНаименование","СоздатьЭлементСубконто",КодАналитикиОтчетов,КодКлассификатора,НаименованиеКлассификатора,ЗначениеПоУмолчанию);
		Иначе
			ТекНаименование = ?(ПустаяСтрока(НаименованиеКлассификатора), КодКлассификатора, НаименованиеКлассификатора);
			Возврат Новый Структура("Действие,Значение,АктуализироватьНаименование,Наименование","ПрименитьЗначение",Ссылка,АктуализироватьНаименование,ТекНаименование);	
		КонецЕсли;
		
	Иначе
		
		Если Ссылка.Пустая() Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			Попытка
				
				НаименованиеЭлемента = ?(ПустаяСтрока(НаименованиеКлассификатора), КодКлассификатора, НаименованиеКлассификатора);
				
				Объект = Справочники.Субконто.СоздатьЭлемент();
				Объект.Код = КодКлассификатора;
				Объект.Наименование = НаименованиеЭлемента;
				Если СтрДлина(НаименованиеЭлемента) > 150 Тогда
					Объект.НаименованиеПолное = НаименованиеЭлемента;		
				КонецЕсли;
				Объект.Владелец = ВладелецСубконото;
				Объект.Записать();
								
			Исключение
				
				ВызватьИсключение;
				
			КонецПопытки;
			
			Ссылка = Объект.Ссылка;			
		КонецЕсли;		
		
		Возврат Ссылка;
		
	КонецЕсли;
	
КонецФункции

Процедура АктуализироватьНаименованиеКлассификатора(ЭлементКлассификатора,Знач АктуальноеНаименование) Экспорт
	//ранее уже проверено, что ЭлементКлассификатора заполнен и Актуальное наименование заполнено
	ТекущееНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементКлассификатора, "Наименование");
	
	НаименованиеДляСравнения = "";
	Если СтрДлина(АктуальноеНаименование)>150 Тогда
		НаименованиеДляСравнения = Лев(АктуальноеНаименование,150);
	Иначе
		НаименованиеДляСравнения = АктуальноеНаименование;
	КонецЕсли;
	
	Если ТекущееНаименование <> НаименованиеДляСравнения Тогда
		Попытка
			УстановитьПривилегированныйРежим(Истина);
			ТекОбъект = ЭлементКлассификатора.ПолучитьОбъект();
			ТекОбъект.Наименование = НаименованиеДляСравнения;
			ТекОбъект.Записать();
			УстановитьПривилегированныйРежим(Ложь);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("Обновление наименования элемента классификатора",УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.Субконто,ЭлементКлассификатора,ТекстОшибки);
		КонецПопытки;
		
	КонецЕсли;
КонецПроцедуры

// Получает значения реквизита у переданного по ссылке объекта информационной базы
//
// Параметры
//  Ссылка - Ссылочный тип
//  ИмяРеквизита - Строка с разделителями ".", определяющая путь до реквизита
//
// Возвращаемое значение:
//   Значение реквизита  - если есть такой реквизит
//   Неопределено  - если такого реквизита нет
//
Функция ЗначениеРеквизита(Знач Ссылка,Знач ИмяРеквизита) Экспорт

	Попытка
			
		ТекСсылка = Ссылка;
		Если ИмяРеквизита<>"" И ЗначениеЗаполнено(ТекСсылка) Тогда
			ИмяРеквизита = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяРеквизита, ".");
			Для каждого ТекИмяРеквизита Из ИмяРеквизита Цикл
				ТекСсылка =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСсылка, ТекИмяРеквизита);
			КонецЦикла;
		ИначеЕсли ИмяРеквизита = "Наименование" Тогда
			ТекСсылка = "";
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекСсылка)
			ИЛИ НЕ ЗначениеЗаполнено(ИмяРеквизита) Тогда
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		Возврат ТекСсылка;
	
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

Функция НайтиКодАналитикиПоБюджету(Знач ПараметрыПоиска) Экспорт
								
	ЗначениеАналитики = Справочники[ПараметрыПоиска.ИмяВидаСправочника].ПустаяСсылка();
	
	ИмяВидаСправочникаЦС = ВРег("ЦелевыеСтатьиКРБ");
	
	Если НЕ ЗаполнениеОтчетностиПовтИсп.ПустоеЗначениеПоля(ПараметрыПоиска.ЗначениеЗаполнения,ИмяВидаСправочникаЦС <> ВРег(ПараметрыПоиска.ИмяВидаСправочника)) Тогда
		
		ДатаДействия = ЗаполнениеОтчетностиПовтИсп.ПолучитьДатуДействия(ПараметрыПоиска.ПериодОтчета);
		
		Запрос = Новый Запрос;
		
		ФедеральныйБюджет = Справочники.Бюджеты.ФедеральныйБюджет;
		
		Запрос.УстановитьПараметр("ФедеральныйБюджет",	ФедеральныйБюджет);
		Запрос.УстановитьПараметр("Код",			 	ПараметрыПоиска.ЗначениеЗаполнения);
		Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаДействия);	
		
		ПолеПорядка = "";
		ПолеОтбора = "";
		
		Если ТипЗнч(ПараметрыПоиска.ПроверятьБюджет) = Тип("Булево") Тогда
					
			Если ПараметрыПоиска.ПроверятьБюджет = Истина Тогда
				БюджетОрганизации = ЗаполнениеОтчетностиПовтИсп.ЗначениеРеквизита(ПараметрыПоиска.Организация, "Бюджет");
				Запрос.УстановитьПараметр("БюджетОрганизации",	БюджетОрганизации);
				
				СтруктураПараметров = ЗаполнениеОтчетностиПовтИсп.ПолучитьПорядокБюджетовДляЗапроса(БюджетОрганизации, ФедеральныйБюджет);
			
				Для Каждого КлючИЗначение Из СтруктураПараметров.СтруктураБюджетов Цикл
					Запрос.УстановитьПараметр(КлючИЗначение.Ключ,КлючИЗначение.Значение);	
				КонецЦикла;
				
				ПолеПорядка = СтруктураПараметров.ПолеПорядка;
			КонецЕсли;
			
		Иначе
				
			Запрос.УстановитьПараметр("ПустойБюджет",	Справочники.Бюджеты.ПустаяСсылка());
				
			ПолеПорядка = "ВЫБОР КОГДА СпрБК.Бюджет = &ФедеральныйБюджет ТОГДА 1 КОГДА СпрБК.Бюджет = &ПустойБюджет ТОГДА 2 ИНАЧЕ 3 КОНЕЦ";
		КонецЕсли;
		
		Если ПараметрыПоиска.ПроверятьДату = Истина Тогда
			ПолеОтбора = "
			|		И СпрБК.ДатаНачалаДействия <= &ДатаАктуальности 
			|		И СпрБК.ДатаОкончанияДействия >= &ДатаАктуальности"
		КонецЕсли;
		
		
				
		Если ПараметрыПоиска.ЭлементВладелец <> Неопределено 
				И ЗначениеЗаполнено(ПараметрыПоиска.РеквизитВладелец) 
				И ЗначениеЗаполнено(ПараметрыПоиска.ИмяВидаВладельца) Тогда
				
			Запрос.УстановитьПараметр("ЭлементВладелец",	ПараметрыПоиска.ЭлементВладелец);
			
			ПолеОтбора = ПолеОтбора + "
			|		И СпрБК."+ПараметрыПоиска.РеквизитВладелец+" В(&ЭлементВладелец, Значение(Справочник."+ПараметрыПоиска.ИмяВидаВладельца+".ПустаяСсылка))";
			
		КонецЕсли;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ Первые 1
			|	СпрБК.Ссылка КАК ЭлементСсылка
			|ИЗ
			|	Справочник."+ПараметрыПоиска.ИмяВидаСправочника+" КАК СпрБК
			|ГДЕ
			|	СпрБК.Код = &Код
			|	"+ПолеОтбора+"
			|"+?(ЗначениеЗаполнено(ПолеПорядка),"УПОРЯДОЧИТЬ ПО 
			|	"+ПолеПорядка,"");
				
		Запрос.Текст = ТекстЗапроса;
					
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЗначениеАналитики = ВыборкаДетальныеЗаписи.ЭлементСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеАналитики;
								
КонецФункции

Функция ПолучитьДатуДействия(Знач ПериодОтчета) Экспорт
	
	Возврат ?(ЗначениеЗаполнено(ПериодОтчета), ПериодОтчета.ДатаОкончания, ТекущаяДатаСеанса());
		
КонецФункции

Функция ПолучитьПорядокБюджетовДляЗапроса(БюджетОрганизации,ФедеральныйБюджет) Экспорт
	
	Перем ВыборкаСсылка, ЗапросБюджеты, КоличествоБюджетовВИерархии, РезультатЗапроса;
	
	ЗапросБюджеты = Новый Запрос;
	ЗапросБюджеты.Текст = 
	"ВЫБРАТЬ
	|	Бюджеты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Бюджеты КАК Бюджеты
	|ГДЕ
	|	Бюджеты.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	ЗапросБюджеты.УстановитьПараметр("Ссылка", БюджетОрганизации);
	РезультатЗапроса = ЗапросБюджеты.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КоличествоБюджетовВИерархии = ВыборкаСсылка.Количество();
	
	НуженЗапросДляФедерального = Истина;
	НомерПорядкаДляФБ = КоличествоБюджетовВИерархии + 1;
	
	ТекстПорядка = "ВЫБОР ";
	СтруктураБюджетов = Новый Структура;
	ОтборБюджет = "";
	Пока ВыборкаСсылка.Следующий() Цикл
		ТекстПорядка = ТекстПорядка + "
		|	 КОГДА СпрБК.Бюджет = &Бюджет"+КоличествоБюджетовВИерархии+" ТОГДА "+КоличествоБюджетовВИерархии;
		
		Если ВыборкаСсылка.Ссылка = ФедеральныйБюджет Тогда
			НуженЗапросДляФедерального = Ложь;
		КонецЕсли;
				
		СтруктураБюджетов.Вставить("Бюджет"+КоличествоБюджетовВИерархии,ВыборкаСсылка.Ссылка);
		КоличествоБюджетовВИерархии = КоличествоБюджетовВИерархии - 1;
	КонецЦикла;
	
	Если НуженЗапросДляФедерального Тогда
		
		ТекстПорядка = ТекстПорядка + "
		|	 КОГДА СпрБК.Бюджет = &ФедеральныйБюджет ТОГДА "+НомерПорядкаДляФБ;
		
	КонецЕсли;
					
	ТекстПорядка = ТекстПорядка + "
		|	ИНАЧЕ 1000 КОНЕЦ";
	
	СтруктураПараметров = Новый Структура("СтруктураБюджетов,ПолеПорядка",СтруктураБюджетов,ТекстПорядка);
	
	Возврат СтруктураПараметров;
КонецФункции

Функция ПустоеЗначениеПоля(ЗначениеЗаполнения, ВсеНулиСчитатьПустой = Истина) Экспорт
	
	ПолеПустое = НЕ ЗначениеЗаполнено(ЗначениеЗаполнения);
	
	Если НЕ ПолеПустое Тогда
	
		ДлинаСтроки = СтрДлина(ЗначениеЗаполнения);
		СтрокаНули = "";
		Для Сч = 1 По ДлинаСтроки Цикл
			СтрокаНули = СтрокаНули + "0";
		КонецЦикла;
		
		Если ЗначениеЗаполнения = СтрокаНули 
			И ВсеНулиСчитатьПустой Тогда
			ПолеПустое = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПолеПустое;
	
КонецФункции

Функция ПолучитьТипыКонтрагентов() Экспорт
	
	СоответствиеТипов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыКонтрагентов.Код КАК Код,
		|	ТипыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТипыКонтрагентов КАК ТипыКонтрагентов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеТипов.Вставить(СокрЛП(ВыборкаДетальныеЗаписи.Код),ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат СоответствиеТипов;
	
КонецФункции

Функция КодИнстЕдиницыПоКЭК(Знач КЭК) Экспорт
	
	КодКЭКИнстЕдиницы = "";
	
	КодКЭК = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КЭК, "Код"));
	КодИнстЕдиницы = Сред(КодКЭК, 3, 1);
	
	Если КодИнстЕдиницы = "0" Тогда
		КодКЭКИнстЕдиницы = "";
	Иначе
		КодКЭКИнстЕдиницы = "00"+КодИнстЕдиницы;
	КонецЕсли;	
	
	Возврат КодКЭКИнстЕдиницы;
	
КонецФункции

Функция ПолучитьЗначениеРеквизитаОС(ОсновноеСредство, Реквизит, Дата = Неопределено) Экспорт 
	
	РезультатПереопределения = ЗаполнениеОтчетностиСерверПереопределяемый.ПолучитьЗначениеРеквизитаОС(ОсновноеСредство, Реквизит, Дата);
	Если РезультатПереопределения.Переопределено Тогда 
		Возврат РезультатПереопределения.Значение;
	КонецЕсли;
	
	Возврат ЗначениеРеквизита(ОсновноеСредство, Реквизит);
	
КонецФункции

Функция ПолучитьМассивТиповДокументовЗакрытияГода() Экспорт
	МассивДокументовЗакрытие = Новый Массив;
	
	ЗаполнениеОтчетностиСерверПереопределяемый.ОпределитьДокументыЗакрытияГода(МассивДокументовЗакрытие);
	
	Возврат МассивДокументовЗакрытие;
КонецФункции

Функция ПолучитьСуммуПоПлануФинансирования(Знач ПараметрыПолучения) Экспорт
	
	СуммаПоПлануФинансирования = 0;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлючАналитикиПФО.Ссылка КАК КлючСсылка
		|ПОМЕСТИТЬ ВТ_КлючиАналитикиПФО
		|ИЗ
		|	Справочник.КлючАналитикиПФО КАК КлючАналитикиПФО
		|ГДЕ
		|	КлючАналитикиПФО.КФО = &КФО
		|	И КлючАналитикиПФО.КПС = &КПС
		|	И КлючАналитикиПФО.КЭК = &КЭК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(ПланФинансированияОбязательствСрезПоследних.Сумма, 0)) КАК Сумма
		|ИЗ
		|	РегистрСведений.ПланФинансированияОбязательств.СрезПоследних(
		|			&НаДату,
		|			Обязательство = &Обязательство
		|				И &ИФО
		|				И Активность = ИСТИНА
		|				И КлючАналитики В
		|					(ВЫБРАТЬ
		|						ВТ_КлючиАналитикиПФО.КлючСсылка КАК КлючСсылка
		|					ИЗ
		|						ВТ_КлючиАналитикиПФО КАК ВТ_КлючиАналитикиПФО)) КАК ПланФинансированияОбязательствСрезПоследних";
	
	ИспользоватьУчетПоИФО = БюджетнаяОтчетностьСервер.ИспользоватьУчетПоИФО();
	
	Если ИспользоватьУчетПоИФО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИФО", "ИФО = &ИФО");
		Запрос.УстановитьПараметр("ИФО", ПараметрыПолучения.ИФО);
	Иначе
		Запрос.УстановитьПараметр("ИФО", Истина);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КФО",				ПараметрыПолучения.КФО);
	Запрос.УстановитьПараметр("КПС",				ПараметрыПолучения.КПС);
	Запрос.УстановитьПараметр("КЭК",				ПараметрыПолучения.КЭК);
	Запрос.УстановитьПараметр("Обязательство",		ПараметрыПолучения.Обязательство);
	Запрос.УстановитьПараметр("НаДату",				ПараметрыПолучения.НаДату);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СуммаПоПлануФинансирования = ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;
	
	Возврат СуммаПоПлануФинансирования;
	
КонецФункции

Функция ПолучитьСуммуПоПлануФинансированияПоСчету(Обязательство, КФО, КПС, СчетДляКЭК, ИФО, НаДату, АдресТаблицыКЭКСчетов) Экспорт
	
	СуммаПоПлануФинансирования = 0;
	
	ТаблицаСоответствияСчетовКЭК = ПолучитьИзВременногоХранилища(АдресТаблицыКЭКСчетов);
	МассивСтрок = ТаблицаСоответствияСчетовКЭК.НайтиСтроки(Новый Структура("Счет",СчетДляКЭК));
	МассивКЭК = Новый Массив;
	Для Каждого СтрТЧ Из МассивСтрок Цикл
		МассивКЭК.Добавить(СтрТЧ.КЭК);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлючАналитикиПФО.Ссылка КАК КлючСсылка
		|ПОМЕСТИТЬ ВТ_КлючиАналитикиПФО
		|ИЗ
		|	Справочник.КлючАналитикиПФО КАК КлючАналитикиПФО
		|ГДЕ
		|	КлючАналитикиПФО.КФО = &КФО
		|	И КлючАналитикиПФО.КПС = &КПС
		|	И КлючАналитикиПФО.КЭК В (&КЭК)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(ПланФинансированияОбязательствСрезПоследних.Сумма, 0)) КАК Сумма
		|ИЗ
		|	РегистрСведений.ПланФинансированияОбязательств.СрезПоследних(
		|			&НаДату,
		|			Обязательство = &Обязательство
		|				И &ИФО
		|				И Активность = ИСТИНА
		|				И КлючАналитики В
		|					(ВЫБРАТЬ
		|						ВТ_КлючиАналитикиПФО.КлючСсылка КАК КлючСсылка
		|					ИЗ
		|						ВТ_КлючиАналитикиПФО КАК ВТ_КлючиАналитикиПФО)) КАК ПланФинансированияОбязательствСрезПоследних";
	
	ИспользоватьУчетПоИФО = БюджетнаяОтчетностьСервер.ИспользоватьУчетПоИФО();
	
	Если ИспользоватьУчетПоИФО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИФО", "ИФО = &ИФО");
		Запрос.УстановитьПараметр("ИФО", ИФО);
	Иначе
		Запрос.УстановитьПараметр("ИФО", Истина);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КФО",				КФО);
	Запрос.УстановитьПараметр("КПС",				КПС);
	Запрос.УстановитьПараметр("КЭК",				МассивКЭК);
	Запрос.УстановитьПараметр("Обязательство",		Обязательство);
	Запрос.УстановитьПараметр("НаДату",				НаДату);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СуммаПоПлануФинансирования = ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;
	
	Возврат СуммаПоПлануФинансирования;
	
КонецФункции
